GetOrderedFilters Method
 Gets the filters applied to the view in the order they are applied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public IList<ElementId> GetOrderedFilters()
Visual Basic
Public Function GetOrderedFilters As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ GetOrderedFilters()
Return Value
 The ElementIds of the Filters.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →